ГрумингСалон/Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГрумингСалон/Catalogs/Договоры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено (Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДействуетДо.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.ДействуетДо) Тогда
			Объект.ДействуетДо = '0001,01,01';
		КонецЕсли
	Иначе
		Элементы.ДействуетДо.Видимость = Истина;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + Формат(Объект.ДатаЗаключенияДоговора, "ДЛФ=Д") + " г.";
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора + " г.";
	Иначе
		Объект.Наименование = "№ " + Формат(Объект.ДатаЗаключенияДоговора, "ДЛФ=Д")  + " г.";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры
